app/Controllers/Clientes.php

    public function index($activo = 1)
    {
        $clientes = $this->clientes->where('activo', $activo)->findALL();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1

    public function eliminar($id=1)
    {
        $this->clientes->update( $id, ['activo' => 0]);
---
UPDATE `clientes` SET `activo` = 0, `fecha_edit` = '2022-07-19 08:40:57'
WHERE `clientes`.`id` IN ('')