app/Controllers/Compras.php

    public function nuevo($activo = 1)
    {
        $compras = $this->compras->where('activo', $activo)->findALL();
---
SELECT *
FROM `compras`
WHERE `activo` = 1