app/Controllers/Unidades.php

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findALL();

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function index2($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findALL();

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function nuevo($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findALL();

SELECT *
FROM `unidades`
WHERE `id` = ' 25'
 LIMIT 1
---
    public function editar($id )
    {

        $unidad = $this->unidades->where('id', $id)->first();

UPDATE `unidades` SET `codigo` = '00543211', `nombre` = 'Monitor gamer', `precio_compra` = '400.00', `descripcion` = 'dteeeeeeeeeeeeee', `marca` = 'TEROS', `fecha_edit` = '2022-07-19 08:40:31'
WHERE `unidades`.`id` IN ('25')
---
    public function actualizar()
    {
        $this->unidades->update( $this->request->getPost('id'), ['codigo'=> $this->request->getPost('codigo'), 'nombre'=> $this->request->getPost('nombre'), 'precio_compra'=> $this->request->getPost('precio_compra'), 'descripcion'=> $this->request->getPost('descripcion'), 'marca'=> $this->request->getPost('marca')]);

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function mostrarMinimos($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findALL();