app/Models/UnidadesModel.php

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function getProductosMinimo(){
        $where = "activo=1";
        return $this->where($where)->findAll();